#include "stm32f4xx.h"                  // Device header




int main(void)
{
	RCC->AHB1ENR |= RCC_AHB1ENR_GPIODEN; // включим тактирование порта
	
	//=========================Конфигурация на выход=====================================
	
	GPIOD->MODER = GPIO_MODER_MODER15_0; // включим ножки 15 на выход
	GPIOD->OTYPER = 0; //подтянем резистор ко всем ножкам порта
	GPIOD->OSPEEDR = 0; //установим скорость LOW на все лапки порта
	GPIOD->ODR&=~GPIO_ODR_ODR_15; //15 лапки установим в 1, тем самым зажжем светодиод
	//===================================================================================
	//===========================Конфигурация  на вход===============
	GPIOA->MODER &= ~ GPIO_MODER_MODER0;
	GPIOA->PUPDR |= GPIO_PUPDR_PUPDR0_1;
	
	
	//===============================================================
	while(1)
	{
		
		if(GPIOA->IDR&GPIO_IDR_IDR_0)
		{
			GPIOD->ODR =GPIO_ODR_ODR_15;
		}
		
	}
}

