#include "ADC.h"

float Vref=0;       //переменная для хранения опорного напряжения

/*
 =========================Функция инициализации АЦП=======================
 * Принимаемые параметры:
 *          
 */
void ADC_Init(uint8_t Uref)
{
    //---------------Настроим тактирование АЦП(F/8)--------
    ADCS0=1;
    ADCS1=0;
   
    //--------------------Включаем разрешение преобразования---------
    ADON=1;
   //------------------------------------
    PCFG0=0;
    PCFG1=0;
    PCFG2=1;
    PCFG3=0;
     //--------------------------------Формат преобразования--------------------
    ADFM=1;
    
    
    Vref=Uref;
}



/*
    ---------------------------------Функция чтения данных из регистра АЦП---------------------
 *                      Принимаемые параметры:
 *                          channel-канал по которому будет считыватся значения
 *                      Возращаемое значение:
 *                          данные из регистра АЦП
 */
uint16_t ADC_Read(uint8_t channel)
{
    if(channel > 7) //If Invalid channel selected 
    return 0;     //Return 0
    
    ADCON0&=0xC5;
    ADCON0 |= channel<<3;
   __delay_ms(2);
   GO_nDONE = 1;
   while(GO_nDONE);
   return ((ADRESH<<8)+ADRESL);
}




