/* 
 * File:   PWM.h
 * Author: Dante_L_Levi
 *
 * Created on 27 марта 2018 г., 16:05
 */

#ifndef PWM_H
#define	PWM_H

#include "Main.h"

#define TMR2PRESCALE 4  //предделитель таймера 2


/*
 ============================Функция задания частоты=========
 */
void FreqSet(long int Fr);

/*
 ============================Функция инициализации ШИМ=============
 */
void PWM_Init(void);

/*
 =======================Функция устанвки значения ШИМ===================
 */
void PWM_Value(uint16_t value);

/*
 ===========================Функция остановки генерирования сигнала===========
 */
void Stop_Generator(void);

/*
 ===========================Функция начала генерирования сигнала===========
 */
void Start_Generator(void);


/*
 ==========================Функция инициализации 16-битного таймера===========
 */
void Timer1_init(void);


/*
 ===========================включаем таймер=======================
 */
void Start_Timer(void);

/*
 ==========================выключаем таймер========================
 */
void Stop_Timer(void);



/*
 ====================================генерируем импульс====================
 */
void Strob(void);

/*
 * ==================================Установка частоты генерации импульсов==========
 */
void Set_Freq_Value(unsigned int value);

/*
 ===========Функция считывания значения с АЦП и преобразование в частоту========
 */
uint16_t ReadValue(void);

#endif	/* PWM_H */

