#ifndef USARTLIB_H
#define	USARTLIB_H

#include "Main.h"




/*
 ==========================================Функция инициализации USART======================
 * Принимаемые параметры:
 *              baud-скорость передачи в бодах
 */
void Usart_Init(long int baud);



/*
 ==============================Функция передачи одного символа==================
 * Принимаемые параметры:
 * data-передаваемый байт по порту
 */
void Transmit_char(char data);


//================================Функция проверки завершения передачи==============================================

char UART_TX_Empty(void);

/*
 ============================Функция передачи строки=========================
 Принимаемые параметры:
 * *Text-указатель на строку для передачи
 */
void Usart_TransmitString(char *Text);

/*
 ==============================Функция перехода на новую строку===============
 */
void GoNewLine(void);


/*
 ==============================Прием символа====================================
 *  Возвращаемое значение: данные из буффера USART
 */
char USART_Read(void);


/*
 ==================================Функция приема строки=================================
 
 *          Принимаемые значения:
 *                  *OutPut- буффер для сохранения даннных из порта
 *                  length-значение длинны принимаемого сообщения
 * 
 */
void UART_Read_Text(char *Output, unsigned int length);


/*
 =====================Проверка на готовность приема============================
 
 *          Возвращаемое значение:
 *              флаг о том что прием разрешен
 */
char UART_Data_Ready(void);




#endif	/* USARTLIB_H */

